app/Http/Controllers/CandidatureController.php

insert into `candidatures` (`name`, `lien`, `enterprise`, `user_id`, `updated_at`, `created_at`) values ('Développeur web', 'https://test1@test.fr', 'Capgiminy', 189, '2023-02-24 10:02:15', '2023-02-24 10:02:15')
---
    public function store(Request $request)
    {
        $validated = $request->validate([
            'name'=>'required|max:50',
            'lien'=>'required|max:150',
            'source_id'=>'required|max:50',
            'enterprise'=>'required|max:50',
        ]);
        $request->user()->candidatures()->create($validated);