app/Http/Controllers/CandidatureController.php

    public function index()
    {
        $candidatures = DB::table('candidatures')
        ->join('enterprises', 'candidatures.enterprise_id', '=', 'enterprises.id')
        ->select('candidatures.*','enterprises.name as enterprise_name' )
        ->where('candidatures.user_id', '=', auth()->user()->id)

        ->get();
---
select * from `enterprises` where `user_id` = 83
select `candidatures`.*, `enterprises`.`name` as `enterprise_name` from `candidatures` inner join `enterprises` on `candidatures`.`enterprise_id` = `enterprises`.`id` where `candidatures`.`user_id` = 83

    public function create()
    {
        $enterprises = DB::table('enterprises')->where('user_id', '=', auth()->user()->id)->get();
        $advancements = Advancement::all();
        $sources = Source::all();
---
select * from `advancements`
select * from `sources`

    public function edit(Candidature $candidature)
    {
        // $candidature = Candidature::find($id);
        $advancements = Advancement::all();
        $sources = Source::all();
---
select * from `advancements`
select * from `sources`