app/Http/Controllers/ContactController.php

    public function index()
    {
        $contacts = Contact::all();
---
select * from `contacts`