app/Http/Controllers/EnterpriseController.php

select * from `enterprises`
---
    public function index()
    {
        $enterprises = Enterprise::all();