app/Http/Controllers/PosteController.php

    public function index()
    {
        $postes = Poste::all();
        $enterprises = Enterprise::all();
        //dd($postes[1]->enterprise->name);
        return view('postes.index',[
            'postes'=>$postes,
            // 'postes'=>Poste::with('user')->latest()->get(),
            'enterprises'=>$enterprises
        ]);
---
select * from `postes`
select * from `enterprises`
select * from `users`

    public function create()
    {
        $postes = Poste::all();
---
select * from `postes`

    public function store(Request $request)
    {
          $validated = $request->validate([
            'title'=>'required|max:100',
            'description'=>'required|max:255',
            'experience'=>'required|max:50',
            'diplome'=>'required|max:50',
            'enterprise_id'=>enterprise::all(),

        ]);
        // $poste = new Poste;
        // $poste->title=$request->title;
        // $poste->description = $request->description;
        // $poste->experience = $request->experience;
        // $poste->diplome = $request->diplome;
        // $poste->enterprise_id = $request->enterprise_id;
        // $poste->user_id = $request->user()->postes();
        // $poste->save();
        $request->user()->postes()->create($validated);
---
select * from `diplomes`
select * from `experiences`
insert into `postes` (`title`, `description`, `experience`, `diplome`, `enterprise_id`, `user_id`, `updated_at`, `created_at`) values ('testqsdsqd', 'test ttttt', '0', 'Enim ea.', '1', 63, '2023-02-21 14:51:27', '2023-02-21 14:51:27')