app/Http/Controllers/PosteController.php

    public function create()
    {
        $enterprises= DB::table('enterprises')->where('user_id', '=', auth()->user()->id)->get();
        $diplomes = Diplome::all();
        $experiences =Experience::all();
        $postes = DB::table('postes')->where('user_id', '=', auth()->user()->id)->get();
---
select * from `enterprises` where `user_id` = 53
select * from `postes` where `user_id` = 53

    public function show(Poste $poste)
    {
        //dd($poste);

        return view('postes.show', [
            'poste'=>$poste,
            'enterprises'=>Enterprise::all(),
        ]);
---
select * from `enterprises`
select * from `postes`

    public function edit(Poste $poste)
    {
        return view('postes.edit', [
            'poste'=>$poste,
            'enterprises'=>Enterprise::all(),
            'experiences'=>Experience::all(),
            'postes'=>Poste::all(),
            'diplomes'=>Diplome::all(),
        ]);
---
select * from `diplomes`
select * from `experiences`
select * from `enterprises`
select * from `postes`